app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route_to
    @movie = Movie.find(id) # look up movie by unique ID

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    redirect = Hash.new
    if params[:sortBy] == "title"
      @movies = Movie.find(:all, :order => "title")
      @title = true
      session[:sortBy] = "title"
    elsif params[:sortBy] == "release"
      @movies = Movie.find(:all, :order => "release_date")
      @release = true
      session[:sortBy] = "release"
    elsif session[:sortBy] != nil
      redirect[:sortBy] = session[:sortBy]
      @movies = Movie.all